{
"articles": ["Important Note:
iPASTORE Windows is a paid companion add-on to manage apps from your windows desktops
It requires existing purchase of either iPASTORE Premium, iPASTORE Lite or iPASTORE TV Packs
If you are new user you must purchase iPASTORE Windows with either of iPASTORE Premium, iPASTORE Lite or iPASTORE TV packs, it wont work as standalone app.
Please use same udid as one of your iPASTORE Premium / Lite / TV Purchases for Registration
Device must be trusted with iTunes to use with iPASTORE Windows
iPASTORE Windows does not sign apps locally it uses Web Services and Remote Servers for resigning. So your internet charges may apply for download and upload of data.
You can manage upto 5 devices which are subscribed to iPASTORE Premium, iPASTORE Lite, iPASTORE TV via iPASTORE Windows.
Login Screen
You have to login to iPASTORE Windows in order to use it, please enter email used for purchase of iPASTORE windows, not for any of iPASTORE Premium, iPASTORE Lite or iPASTORE TV Purchases.
Login_Screen
App Listing Screen
This Screen gives you information on all App lists.
Latest Apps – All latest apps submitted to iphonecake.com for iPhone, iPads, universal
Popular Apps – most downloaded apps from iphonecake.com for iPhone, iPads, universal
Categories – category wise browsing for apps for iPhone, iPads, universal
Mods – modded apps from iphonecake.com for iPhone, iPads, universal
Tweaks – tweaked apps from iphonecake.com for iPhone, iPads, universal
TV Apps – Apple TV apps from iphonecake.com for iPhone, iPads, universal
Listing_Screen
App Details Screen
Click on any app from any App Listing mentioned above, will give you details of that particular app.
Details_Screen
App Downloads
To download resigned app for a particular device, on App Details Screen click on Download.
After you Click on Download, popup will be displayed with list of iDevices connected to iPASTORE Windows with Device Name | Email | Certificate
Select desired device and operation will begin.
Operation status can be monitored at the bottom of application screen.
iPASTORE Windows does not resign apps locally it uses Web Services and Remote servers for resigning. So your internet charges may apply for download and upload of data.
Download_Screen
Details_Screen
Downloaded Apps
This screen gives you information of Apps Downloaded via iPASTORE Windows
All signed and downloaded apps are stored in [Users]/Downloads/iPASTOREWIN
downloaded (resigned for particular iDevice) apps can be installed directly using iPASTORE Windows.
Please note apps will install only on devices for which they are signed. Ex. If you try to install app signed for Device 1 on Device 2 it will fail.
All apps has Certificate ID assigned in the end, so you can check that in Settings of iPASTORE Windows or Settings of iPASTORE Premium or Lite on iOS Device.
Downloads_Screen
Self Resign & App Imports
You can resign your own ipa sized upto 3Gb files, weather its developer or download from Internet from any site using this screen.
Browse and select the ipa file from your pc
Click on upload
popup will be displayed with list of iDevices connected to iPASTORE Windows with Device Name | Email | Certificate
select desired device and operation will begin.
Status of operation can be monitored on bottom of application screen.
iPASTORE Windows does not resign apps locally it uses Web Services and Remote Servers for resigning. So your internet charges may apply for download and upload of data.
Imports_Screen
Imports_Screen
Settings Screen
This Screen gives you information about your device connected to iPASTORE Windows, Some options and more features coming in future.
To Connect Device to iPASTORE Windows
Connect your device with USB Port to your PC using cable
Click on Add Device
Device will be added on Side Panel Then you can manage the device using iPASTORE Windows.
Please Note:
Device must be trusted with iTunes to use with iPASTORE Windows
Only Devices subscribed to iPASTORE Premium, iPASTORE Lite or iPASTORE TV can be connected and managed using iPASTORE Windows.
Once device is connected to 1 iPASTORE Windows it can not be connected on another machine or iPASTORE Windows."]
}
